{"staff": "james", "body": "Jekyll post not getting generated\r\n\r\nThere are some reasons for this. Make sure you did not get any page build error. If so, read How to deal with page build errors. Most of the times it will be a markdown syntax error.\r\nCheck 1: Location of post file\r\n\r\nJekyll treats a file as a post if it is inside _posts directory. If your post is somewhere else then move it inside _posts directory.\r\nCheck 2: Incorrect post title\r\n\r\nJekyll posts should be named in this format YYYY-MM-DD-title.MARKUP. Check if your posts follow this pattern. Generally .md or .markdown is used in place of .MARKUP.\r\n\r\nCheck 3: Post has a future date\r\n\r\nIf you have not mentioned any timezone in the configuration, then Jekyll sets it to your operating system timezone. Sometimes you may give today’s date in the filename like 2018-01-05-some-title.md(yes, today!) but based on timezone the date could be in the future. Jekyll will not show it today. Comeback and check tomorrow. Or if you can’t wait then add this line to the post’s front matter to make future posts visible - future: true.\r\nCheck 4: Title has : character\r\n\r\nIf your title has : as a string then Jekyll throws an error. One way to solve this is by removing it or replacing it by &#58;. The best way to solve this is by quoting the title with apostrophes.\r\n\r\n\r\nCheck 4: Front matter has published: false\r\n\r\nIf a post contains published: false in the front matter, then that post will not show up anywhere. Either remove it or change it to published: true to see the post in the output.\r\n\r\nOne of those should solve the issue.\r\nUsing Jekyll code blocks in Jekyll\r\n\r\nI have observed this in many new Jekyll users. Whenever they are tring to show a Liquid syntax code block in a post, they either use some other symbol for curly braces or they put screenshots of the code.\r\n\r\nThis is not necessary. You can actually sh", "categories": ["Node"], "title": "THe edited first blog again"}